tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Run arbitrary commands when files change
brew "entr"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud", args: { appdir: "/Applications" }
# Menu bar icon organizer
cask "bartender", args: { appdir: "/Applications" }
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Graphical configurator for Kaleidoscope-powered keyboards
cask "chrysalis"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Screen capturing tool
cask "cleanshot"
# Plain-text editor for web pages, program source codes and more
cask "coteditor", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
# Japanese input software
cask "google-japanese-ime", args: { appdir: "/Applications" }
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Interface for reading and syncing eBooks
cask "kindle"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger", args: { appdir: "/Applications" }
# Icon manager and library
cask "nucleo"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
# Menu bar customization tool
cask "swiftbar"
# Native GUI tool for relational databases
cask "tableplus", args: { appdir: "/Applications" }
# File transfer application
cask "transmit", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code"
mas "Craft", id: 1487937127
mas "Image Tool+", id: 1524216218
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Tailscale", id: 1475387142
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
vscode "adam-bender.commit-message-editor"
vscode "artdiniz.quitcontrol-vscode"
vscode "bmalehorn.vscode-fish"
vscode "christian-kohler.path-intellisense"
vscode "DavidLGoldberg.jumpy2"
vscode "EditorConfig.EditorConfig"
vscode "Equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GitHub.codespaces"
vscode "GitHub.copilot"
vscode "GitHub.remotehub"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "metaseed.metago"
vscode "metaseed.MetaJump"
vscode "metaseed.MetaWord"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vsliveshare.vsliveshare"
vscode "nmsmith89.incrementor"
vscode "oderwat.indent-rainbow"
vscode "PKief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "satokaz.vscode-bs-ctrlchar-remover"
vscode "streetsidesoftware.code-spell-checker"
vscode "Tailscale.vscode-tailscale"
vscode "tamasfe.even-better-toml"
vscode "tranhl.find-then-jump"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
