tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line DNS client
brew "dog"
# Run arbitrary commands when files change
brew "entr"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Plugin manager for the Fish shell
brew "fisher"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Password manager that keeps all passwords secure behind one password
cask "1password", args: { appdir: "/Applications" }
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Collection of apps and services for photography, design, video, web, and UX
cask "adobe-creative-cloud", args: { appdir: "/Applications" }
# Application uninstaller
cask "appcleaner", args: { appdir: "/Applications" }
# Menu bar icon organizer
cask "bartender", args: { appdir: "/Applications" }
# Tool to customize input devices and automate computer systems
cask "bettertouchtool"
# Screen capturing tool
cask "cleanshot"
# Plain-text editor for web pages, program source codes and more
cask "coteditor", args: { appdir: "/Applications" }
# Web browser
cask "firefox", args: { appdir: "/Applications" }
# Japanese programming font which is a composed of Hack and GenJyuu-Gothic
cask "font-hackgen-nerd"
# Web browser
cask "google-chrome", args: { appdir: "/Applications" }
cask "google-japanese-ime", args: { appdir: "/Applications" }
# HTTP and GraphQL Client
cask "insomnia"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Interface for reading and syncing eBooks
cask "kindle"
# Native desktop app for Messenger (formerly Facebook Messenger)
cask "messenger", args: { appdir: "/Applications" }
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack", args: { appdir: "/Applications" }
# Menu bar customization tool
cask "swiftbar"
# Native GUI tool for relational databases
cask "tableplus", args: { appdir: "/Applications" }
# File transfer application
cask "transmit", args: { appdir: "/Applications" }
# Open-source code editor
cask "visual-studio-code", args: { appdir: "/Applications" }
# Video communication and virtual meeting platform
cask "zoom"
mas "Craft", id: 1487937127
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Tailscale", id: 1475387142
mas "Unsplash Wallpapers", id: 1284863847
mas "Xcode", id: 497799835
